---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.#ctor
source: html/db47f270-89ea-6aa6-7b2e-bbef48346f75.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.#ctor Method

Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0

## Syntax (C#)
```csharp
public ElectricalDemandFactorValue()
```